작업형 1

DataUrl = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_1.csv 캘리포니아 집값 일부 변형 : https://www.kaggle.com/datasets/harrywang/housing?select=housing.csv)

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_1.csv')
df

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

결측치가 하나라도 존재하는 행의 경우 경우 해당 행을 삭제하라. 그후 남은 데이터의 상위 70%에 해당하는 데이터만 남겨둔 후 median_income 컬럼의 1분위수를 반올림하여 소숫점이하 2째자리까지 구하여라 - 다시

In [3]:
df = df.dropna().reset_index(drop = True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18957 entries, 0 to 18956
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           18957 non-null  float64
 1   latitude            18957 non-null  float64
 2   housing_median_age  18957 non-null  float64
 3   total_rooms         18957 non-null  float64
 4   total_bedrooms      18957 non-null  float64
 5   population          18957 non-null  float64
 6   households          18957 non-null  float64
 7   median_income       18957 non-null  float64
 8   median_house_value  18957 non-null  float64
 9   ocean_proximity     18957 non-null  object
dtypes: float64(9), object(1)
memory usage: 1.4+ MB

In [4]:
df_filter = df.iloc[:int(len(df)*0.7)]
result = df_filter['median_income'].quantile(0.25).round(2)

In [5]:
result

2.51

In [6]:
df.iloc[int(len(df)*0.7)]

longitude                -117.08
latitude                   32.63
housing_median_age          28.0
total_rooms               2080.0
total_bedrooms             427.0
population                1266.0
households                 434.0
median_income             2.2788
median_house_value      146300.0
ocean_proximity       NEAR OCEAN
Name: 13269, dtype: object

DataUrl = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_2.csv 년도별 국가의 GDP : https://www.kaggle.com/datasets/tunguz/country-regional-and-world-gdp

In [7]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_2.csv')
df.head()

  Country Name Country Code  Year      Value
0   Arab World          ARB  1968  2576068.3
1   Arab World          ARB  1969  2843420.4
2   Arab World          ARB  1970  3138550.0
3   Arab World          ARB  1971  3642691.0
4   Arab World          ARB  1972  4331605.7

1990년도는 해당년도 평균 이하 GDP를 가지지만, 2010년도에는 해당년도 평균 이상 GDP를 가지는 국가의 숫자를 구하여라  - 다시

In [8]:
df_1990 = df[df.Year == 1990]
df_2010 = df[df.Year == 2010]

In [9]:
filter_90 = df_1990[df_1990.Value <= df_1990.Value.mean()]
filter_10 = df_2010[df_2010.Value >= df_2010.Value.mean()]

In [10]:
len(set(filter_90['Country Code']) & set(filter_10['Country Code']))

5

DataUrl = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_3.csv 타이타닉 탑승자 생존 데이터 : https://www.kaggle.com/competitions/titanic

In [11]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_3.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3,1,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,C85,S
3,4,1,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5,0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,C123,S

데이터에서 결측치가 가장 많은 컬럼을 출력하라

In [12]:
print(df.isnull().sum().sort_values(ascending = False).index[0]) # isnull().sum() 외우기

Fare

작업형 2

여행자 보험 가입여부 분류 : https://www.kaggle.com/datasets/tejashvi14/travel-insurance-prediction-data
DataUrl(train) = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p2_train_.csv
DataUrl(test) = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p2_test_.csv
종속 변수 : TravelInsurance , TravelInsurance가 1일 확률을 구해서 제출하라. 평가지표 : auc
제출 파일의 컬럼은 ID, proba 두개만 존재해야한다.

In [13]:
import pandas as pd
train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p2_train_.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p2_test_.csv')
train.head()

,ID,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad,TravelInsurance
0,1008,26,Private Sector/Self Employed,Yes,1400000,5,0,No,Yes,1
1,199,30,Private Sector/Self Employed,No,1450000,5,0,Yes,Yes,1
2,86,32,Government Sector,Yes,900000,4,0,No,No,0
3,560,26,Private Sector/Self Employed,Yes,1400000,7,0,No,Yes,1
4,161,34,Private Sector/Self Employed,No,1400000,3,1,No,Yes,1

In [14]:
test.head()

,ID,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
0,6,31,Government Sector,Yes,1300000,4,0,No,No
1,9,33,Government Sector,Yes,800000,3,0,Yes,No
2,20,28,Private Sector/Self Employed,Yes,1150000,6,0,Yes,No
3,21,29,Private Sector/Self Employed,Yes,350000,3,0,No,No
4,23,28,Government Sector,Yes,600000,9,0,No,No

In [15]:
train.nunique()

ID                     1490
Age                      11
Employment Type           2
GraduateOrNot             2
AnnualIncome             30
FamilyMembers             8
ChronicDiseases           2
FrequentFlyer             2
EverTravelledAbroad       2
TravelInsurance           2
dtype: int64

In [16]:
drop_col = ['ID']
train_drop = train.drop(columns = drop_col)

In [17]:
y_train = train_drop['TravelInsurance']
x_train = train_drop.drop(columns = 'TravelInsurance')

In [18]:
x_test = test

In [19]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import roc_auc_score

In [20]:
X_train, X_validation, Y_train, Y_validation = train_test_split(x_train, y_train, stratify = y_train, random_state = 42)

In [21]:
x_train_dum = pd.get_dummies(X_train)
x_test_dum = pd.get_dummies(X_validation)[x_train_dum.columns]

In [22]:
rf = RandomForestClassifier(random_state = 23)
rf.fit(x_train_dum, Y_train)

RandomForestClassifier(random_state=23)

In [23]:
predict = rf.predict_proba(x_test_dum)[:,1]

In [24]:
roc_auc_score(Y_validation, predict)

0.7481829573934837

In [25]:
test_drop = test.drop(columns =['ID'])
dum_test = pd.get_dummies(test_drop)[x_train_dum.columns]
test_pred  = rf.predict_proba(dum_test)[:,1]
test_pred_df = pd.DataFrame(test_pred,columns =['proba'])
summission = pd.concat([test['ID'],test_pred_df],axis=1)
display(summission.head())

   ID     proba
0   6  0.030000
1   9  0.190000
2  20  0.127159
3  21  0.129036
4  23  0.030000

작업형

다이어트약의 전후 체중 변화 기록이다. DataUrl = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_1.csv 투약 후 체중에서 투약 전 체중을 뺏을 때 값은 일반 적으로 세가지 등급으로 나눈다. -3이하 : A등급, -3초과 0이하 : B등급, 0 초과 : C등급. 약 실험에서 A,B,C 그룹간의 인원 수 비율은 2:1:1로 알려져 있다. 위 데이터 표본은 각 범주의 비율에 적합한지 카이제곱 검정하려한다.

In [26]:
import pandas as pd 
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_1.csv')
df.head()

       ID     투약전     투약후
0  user_1  55.137  56.106
1  user_2  66.584  60.409
2  user_3  52.259  50.639
3  user_4  77.081  69.164
4  user_5  62.677  57.622

In [27]:
from scipy.stats import ttest_rel

In [28]:
before = df['투약전']
after = df['투약후']

In [29]:
df['등급'] = (after - before)
df

           ID     투약전     투약후     등급
0      user_1  55.137  56.106  0.969
1      user_2  66.584  60.409 -6.175
2      user_3  52.259  50.639 -1.620
3      user_4  77.081  69.164 -7.917
4      user_5  62.677  57.622 -5.055
..        ...     ...     ...    ...
230  user_231  78.041  81.021  2.980
231  user_232  77.187  68.417 -8.770
232  user_233  50.640  51.139  0.499
233  user_234  58.133  49.653 -8.480
234  user_235  55.422  55.179 -0.243

[235 rows x 4 columns]

In [32]:
import warnings
warnings.filterwarnings('ignore')

In [33]:
for i in range(235):
    if (after - before)[i] <= -3 :
        df['등급'][i] = 'A'
    elif (after - before)[i] < 0 :
        df['등급'][i] = 'B'
    else:
        df['등급'][i] = 'C'

In [35]:
df

           ID     투약전     투약후 등급
0      user_1  55.137  56.106  C
1      user_2  66.584  60.409  A
2      user_3  52.259  50.639  B
3      user_4  77.081  69.164  A
4      user_5  62.677  57.622  A
..        ...     ...     ... ..
230  user_231  78.041  81.021  C
231  user_232  77.187  68.417  A
232  user_233  50.640  51.139  C
233  user_234  58.133  49.653  A
234  user_235  55.422  55.179  B

[235 rows x 4 columns]

In [36]:
len(df[df['등급'] == 'A'])

121

In [71]:
from scipy.stats import shapiro, chisquare, levene

카이제곱검정 통계량을 반올림하여 소숫점 이하 3째자리까지 구하여라

그룹간의 인원 수 비율은 2:1:1로 알려져 있다

In [51]:
target_df = df['등급'].value_counts().to_frame()
target_df

    등급
A  121
B   67
C   47

In [52]:
target_df['expected'] = [target_df['등급'].sum() * 0.5, target_df['등급'].sum() * 0.25, target_df['등급'].sum() * 0.25]
target_df

    등급  expected
A  121    117.50
B   67     58.75
C   47     58.75

In [56]:
s, p = chisquare(target_df['등급'], target_df['expected'])

In [58]:
p >0.05

True

귀무가설을 기각할 수 없다

In [59]:
round(s, 3)

3.613

다이어트약의 전후 체중 변화 기록이다. DataUrl = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_2.csv A,B 공장에서 생산한 기계들의 rpm 값들을 기록한 데이터이다. 대응 표본 t 검정을 통해 B공장 제품들이 A 공장 제품들보다 rpm이 높다고 말할 수 있는지 검정하려한다

In [60]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_2_.csv')
df.head()

     rpm group
0  163.6     A
1  246.9     A
2  234.9     A
3  156.9     A
4  226.6     A

In [68]:
adf = df[df['group'] == 'A'].rpm
bdf = df[df['group'] == 'B'].rpm

A,B 공장 각각 정규성을 가지는지 샤피로 검정을 통해 확인하라. (각 공장의 pvalue 출력할 것)

In [69]:
shapiro(adf)

ShapiroResult(statistic=0.9863898158073425, pvalue=0.397915244102478)

In [70]:
shapiro(bdf)

ShapiroResult(statistic=0.9943944811820984, pvalue=0.9562830924987793)

A,B 공장 생산 제품의 rpm은 각각 등분산성을 가지는지 확인하라. (각 공장의 pvalue 출력할 것)

In [74]:
s, p = levene(adf, bdf)
round(p, 3)

0.904

대응 표본 t 검정을 통해 B공장 제품들의 rpm이 A 공장 제품의 rpm보다 크다고 말할 수 있는지 검정하라. pvalue를 소숫점 이하 3자리까지 출력하고 귀무가설, 대립가설 중 하나를 출력하라*

In [77]:
s, p = ttest_rel(adf, bdf, alternative='less')
round(p, 3)

0.009

In [78]:
# -> 대립가설 채택